public class Info {

    /**
     * 5. Классы и объекты
     * Понятие интерфейса, класса, абстрактного класса, объекта, конструктора класса
     * Методы
     * Object
     * equals
     * hashCode
     *
     * @param args
     */
    public static void main(String[] args) {
        //рассказать про выравнивание при коммите.
        //lombok
        //класс, экземпляр класс (класс это шаблон)
        //конструкторы
        //this в конструкторе
        //пакеты, классы могут быть одинаковые в разных пакетах
        //import * и статический импорт, констната
        //логические блоки(значение по умолчанию) и статические(единожды что то сделать)
        // модификаторы доступа public private protected package
        //статическая переменная: персон сколько объектов было создано
        //внутренний класс
        //address
        //перегрузка методов PersonRegistry
        //енам??
        //модификаторы доступа бывают Public Private Protected Default
        //для класса, метода или поля.

        //default(package) - Такие поля или методы видны всем классам в текущем пакете.
        //public - все везде доступно
        //protected - в пределах пакета, или у наследников и даже в любом пакете
        //private - только в классе, что бы не изменяли переменный то их закрываем и даем модификатор приватный
        //поговорим про гет и сет
        //Инкапсуляция - сокрытие данных внутри некоторой области видимости
    }
}
