public class ThreadInfo {
    //https://ru.wikipedia.org/wiki/%D0%93%D0%B5%D1%80%D1%86_(%D0%B5%D0%B4%D0%B8%D0%BD%D0%B8%D1%86%D0%B0_%D0%B8%D0%B7%D0%BC%D0%B5%D1%80%D0%B5%D0%BD%D0%B8%D1%8F)
    /**
     * - что такое Ггц тактовая частота процессора(кол-во операций в секунду). ядра
     * - параллельно выполняются процессы на процессоре.
     * - браузер многопоточность!
     * - процессор это мозг. отвечает за все вычисления в компе
     * 2,6 Ггц - Герц (означает одно исполнение (реализацию) такого процесса за одну секунду, другими словами — одно колебание в секунду.)
     * потоки исполняются на ядрах процессора
     * - планировщик задач - он решает кто будет из потоков выполняться
     * - псевдо параллеризм( на одном ядре может выполнить 2,6 миллиарда операций в секунду(очень быстро)
     */
}
