public class Info {
    /**
     * GET - получение ресурса(дай мне что то html странцу)
     * POST - создание ресурса(создает или сохраняет в базу ресурс)
     * PUT - обновление ресурса(имя поменялось нужно обновить)
     * DELETE - удаление ресурса
     *
     * HEAD - это только для получения заголовков от ресурса(похож на GET но ничего не возвращает)
     * хочет получить информацию(мета инфа) о документе но не получая сам документ.
     * получить размер файла, существует, когда последний раз изменялся. Экономит время и трафик.
     * CONNECT - устанавливает тунель к серверу по определенному ресурсу
     * для доступа к сайту который использует SSL(уровень защищеных сокетов)
     * по https информация передается по защищенному протаколу.
     * требуется сертификат (уникальная цифровая подпись вашего сайта)
     * OPTIONS - для описания параметров соединения с ресурсом
     * можно узнать какие методы поддерживает сервис.
     * TRACE - что происходит с сообщением на промежуточных узлах в процессе отправки
     * PATCH - дельта обновления
     *
     * //про контент тайп рассказать
     *
     *
     * клиент - серверная архитектура
     * веб сервер томкат(контейнер сервлетов)
     * классы на языке жава которые имеют инфу из http запроса
     *
     *
     */

}
