public class HomeWork {
    /**
     * Сервлеты.
     *1) Клиент при обращении к серверу получает случайно выбранное стихотворение Максима Богдановича из файла.
     *
     *2) Создать сервлет для вывода текущей даты и времени. Постоянное обновление страницы или коммонента, что бы время в браузере обновлялось.
     *
     *3) Создать сервлет для вывода дня недели по введенной дате. Методом GET.
     *
     *4) Создать сервлет для вывода номера дня в году по введенной дате. POST
     *
     *5) Создать сервлет для вывода количества посещений страницы(использовать сессию)
     *
     * Html and css
     * Основное задание
     *
     * 1. Создать html страницу для решения задания
     *
     * http://www.itmathrepetitor.ru/zadachi-po-html-i-css-zadacha-13-zapis-na-kursy/
     *
     * Дополнительное задание
     *
     * 2. Создать html+css страницу для решения задания
     *
     * http://www.itmathrepetitor.ru/zadachi-po-html-i-css-vojjti-ili-zaregistrirov/
     *
     * Bootstrap
     * Создать сайт-визитку.
     *
     * Сайт должен содержать:
     *
     * Вашу фотографию
     *
     * Небольшой текст, представляющий Вас как высококлассного специалиста в какой-либо сфере.
     *
     * Прочую информацию, которую Вы посчитаете нужным разместить на странице.
     *
     *
     * JSP
     * Основное задание
     *
     * 1. Создать страницу save-request.jsp, содержащую форму для ввода заявки.
     *
     * Форма должна отправлять данные в POST запросе сервлету, который их
     *
     * проверяет.
     *
     * Если одно из полей не указано -> сервлет должен снова перенаправить
     *
     * на страницу ввода данных.
     *
     * Если указаны верно -> сервлет должен перенаправить на страницу, на
     *
     * которой нужно отобразить текст:
     *
     * «Заявка успешно сохранена"
     *
     * JSTL
     * Доработать домашки предыдущие используя jstl библиотеку
     */

}
